Revit 2025 API
ExportTextQualifier Enumeration
 Options for the text qualifier character in schedule view export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ExportTextQualifier
Public Enumeration ExportTextQualifier
public enum class ExportTextQualifier
type ExportTextQualifier
Members
Member name | Value | Description
None | 0 |  No text qualifier.
Quote | 1 |  The quote character - ' - is used to qualify text.
DoubleQuote | 2 |  The quote character - " - is used to qualify text.
See Also
Reference
Autodesk.Revit.DB Namespace